Ran Plan for project: `dev` dir: `.` workspace: `default`

<details><summary>Show Output</summary>

```diff
module.org-read.data.aws_iam_policy_document.org_read_assume: Reading...
module.org-read.data.aws_iam_policy.org_readonly_access: Reading...
module.access.data.aws_iam_policy_document.discover_assume: Reading...
module.access.data.aws_iam_policy_document.describe_augments: Reading...
module.access.data.aws_partition.current: Reading...
module.access.data.aws_iam_policy_document.execution_assume: Reading...
module.access.data.aws_caller_identity.current: Reading...
module.org-read.data.aws_iam_policy_document.tags_read: Reading...
module.access.data.aws_iam_policy.readonly_access: Reading...
module.access.data.aws_arn.stacklet_assetdb_role_arn: Reading...
module.org-read.data.aws_iam_policy_document.tags_read: Read complete after 0s [id=2844959228]
module.access.data.aws_iam_policy_document.describe_augments: Read complete after 0s [id=342937604]
module.access.data.aws_partition.current: Read complete after 0s [id=aws]
module.access.data.aws_arn.stacklet_assetdb_role_arn: Read complete after 0s [id=arn:aws:iam::179874453562:role/qa-collector]
module.access.data.aws_iam_policy_document.execution_assume: Read complete after 0s [id=3176330248]
module.org-read.data.aws_iam_policy_document.org_read_assume: Read complete after 0s [id=982059331]
module.access.data.aws_iam_policy_document.discover_assume: Read complete after 0s [id=398292491]
module.access.data.aws_caller_identity.current: Read complete after 0s [id=880584957794]
module.access.data.aws_iam_policy_document.forward_assume: Reading...
module.access.data.aws_iam_policy_document.forward_assume: Read complete after 0s [id=3959961479]
module.access.data.aws_iam_policy_document.forward["us-east-2"]: Reading...
module.access.data.aws_iam_policy_document.forward["us-east-2"]: Read complete after 0s [id=1223039427]
module.access.data.aws_iam_policy_document.forward["us-east-1"]: Reading...
module.access.data.aws_iam_policy_document.forward["us-east-1"]: Read complete after 0s [id=1999464278]
module.access.data.aws_iam_policy.readonly_access: Read complete after 2s [id=arn:aws:iam::aws:policy/ReadOnlyAccess]
module.org-read.data.aws_iam_policy.org_readonly_access: Read complete after 2s [id=arn:aws:iam::aws:policy/AWSOrganizationsReadOnlyAccess]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # module.access.aws_cloudwatch_event_rule.forward["us-east-1"] will be created
+ resource "aws_cloudwatch_event_rule" "forward" {
      + arn            = (known after apply)
      + description    = "Event forwarding for atlantis-ci Stacklet deployment"
      + event_bus_name = "default"
      + event_pattern  = jsonencode(
            {
              + "$or" = [
                  + {
                      + detail      = {
                          + errorCode       = [
                              + {
                                  + exists = false
                                },
                            ]
                          + eventSource     = [
                              + {
                                  + anything-but = [
                                      + "sts.amazonaws.com",
                                    ]
                                },
                            ]
                          + managementEvent = [
                              + true,
                            ]
                          + readOnly        = [
                              + false,
                            ]
                        }
                      + detail-type = [
                          + "AWS API Call via CloudTrail",
                        ]
                    },
                  + {
                      + detail-type = [
                          + "AWS Console Sign In via CloudTrail",
                          + "EC2 Instance State-change Notification",
                          + "GuardDuty Finding",
                          + "AWS Health Event",
                          + "EC2 Instance Launch Successful",
                          + "EC2 Instance Launch Unsuccessful",
                          + "EC2 Instance Terminate Successful",
                          + "EC2 Instance Terminate Unsuccessful",
                          + "Security Hub Findings - Imported",
                          + "Security Hub Findings - Custom Action",
                          + "Security Hub Insight Results",
                        ]
                    },
                ]
            }
        )
      + force_destroy  = false
      + id             = (known after apply)
      + name           = "atlantis-ci-event-forward"
      + name_prefix    = (known after apply)
      + region         = "us-east-1"
      + tags_all       = (known after apply)
    }

  # module.access.aws_cloudwatch_event_rule.forward["us-east-2"] will be created
+ resource "aws_cloudwatch_event_rule" "forward" {
      + arn            = (known after apply)
      + description    = "Event forwarding for atlantis-ci Stacklet deployment"
      + event_bus_name = "default"
      + event_pattern  = jsonencode(
            {
              + "$or" = [
                  + {
                      + detail      = {
                          + errorCode       = [
                              + {
                                  + exists = false
                                },
                            ]
                          + eventSource     = [
                              + {
                                  + anything-but = [
                                      + "sts.amazonaws.com",
                                    ]
                                },
                            ]
                          + managementEvent = [
                              + true,
                            ]
                          + readOnly        = [
                              + false,
                            ]
                        }
                      + detail-type = [
                          + "AWS API Call via CloudTrail",
                        ]
                    },
                  + {
                      + detail-type = [
                          + "AWS Console Sign In via CloudTrail",
                          + "EC2 Instance State-change Notification",
                          + "GuardDuty Finding",
                          + "AWS Health Event",
                          + "EC2 Instance Launch Successful",
                          + "EC2 Instance Launch Unsuccessful",
                          + "EC2 Instance Terminate Successful",
                          + "EC2 Instance Terminate Unsuccessful",
                          + "Security Hub Findings - Imported",
                          + "Security Hub Findings - Custom Action",
                          + "Security Hub Insight Results",
                        ]
                    },
                ]
            }
        )
      + force_destroy  = false
      + id             = (known after apply)
      + name           = "atlantis-ci-event-forward"
      + name_prefix    = (known after apply)
      + region         = "us-east-2"
      + tags_all       = (known after apply)
    }

  # module.access.aws_cloudwatch_event_target.forward["us-east-1"] will be created
+ resource "aws_cloudwatch_event_target" "forward" {
      + arn            = "arn:aws:events:us-east-1:179874453562:event-bus/default"
      + event_bus_name = "default"
      + force_destroy  = false
      + id             = (known after apply)
      + region         = "us-east-1"
      + role_arn       = (known after apply)
      + rule           = "atlantis-ci-event-forward"
      + target_id      = "atlantis-ci-event-forward"
    }

  # module.access.aws_cloudwatch_event_target.forward["us-east-2"] will be created
+ resource "aws_cloudwatch_event_target" "forward" {
      + arn            = "arn:aws:events:us-east-2:179874453562:event-bus/default"
      + event_bus_name = "default"
      + force_destroy  = false
      + id             = (known after apply)
      + region         = "us-east-2"
      + role_arn       = (known after apply)
      + rule           = "atlantis-ci-event-forward"
      + target_id      = "atlantis-ci-event-forward"
    }

  # module.access.aws_iam_policy.forward["us-east-1"] will be created
+ resource "aws_iam_policy" "forward" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Forward events for atlantis-ci Stacklet deployment in region us-east-1"
      + id               = (known after apply)
      + name             = "atlantis-ci-forward-events-us-east-1"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "events:PutEvents"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:events:us-east-1:179874453562:event-bus/default"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.access.aws_iam_policy.forward["us-east-2"] will be created
+ resource "aws_iam_policy" "forward" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Forward events for atlantis-ci Stacklet deployment in region us-east-2"
      + id               = (known after apply)
      + name             = "atlantis-ci-forward-events-us-east-2"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "events:PutEvents"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:events:us-east-2:179874453562:event-bus/default"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.access.aws_iam_role.discover will be created
+ resource "aws_iam_role" "discover" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Condition = {
                          + StringEquals = {
                              + "sts:ExternalId" = "b5748e1f-0fa5-47c2-b9e2-84108424dd6a"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::179874453562:role/qa-collector"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "Read-Only Resource Collection for atlantis-ci Stacklet deployment"
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "atlantis-ci-discover"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.access.aws_iam_role.execution will be created
+ resource "aws_iam_role" "execution" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Condition = {
                          + StringEquals = {
                              + "sts:ExternalId" = "b5748e1f-0fa5-47c2-b9e2-84108424dd6a"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::179874453562:role/qa-stacklet-execution"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "Execution for atlantis-ci Stacklet deployment"
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "atlantis-ci-execution"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.access.aws_iam_role.forward[0] will be created
+ resource "aws_iam_role" "forward" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "events.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "Event forwarding for atlantis-ci Stacklet deployment"
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "atlantis-ci-forward"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.access.aws_iam_role_policy.discover_describe_augments will be created
+ resource "aws_iam_role_policy" "discover_describe_augments" {
      + id          = (known after apply)
      + name        = "DescribeAugments"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "support:Describe*",
                          + "quicksight:ListUsers",
                          + "quicksight:ListGroups",
                          + "identitystore:List*",
                          + "identitystore:Describe*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # module.access.aws_iam_role_policy.execution_describe_augments will be created
+ resource "aws_iam_role_policy" "execution_describe_augments" {
      + id          = (known after apply)
      + name        = "DescribeAugments"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "support:Describe*",
                          + "quicksight:ListUsers",
                          + "quicksight:ListGroups",
                          + "identitystore:List*",
                          + "identitystore:Describe*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # module.access.aws_iam_role_policy_attachment.forward["us-east-1"] will be created
+ resource "aws_iam_role_policy_attachment" "forward" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "atlantis-ci-forward"
    }

  # module.access.aws_iam_role_policy_attachment.forward["us-east-2"] will be created
+ resource "aws_iam_role_policy_attachment" "forward" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "atlantis-ci-forward"
    }

  # module.access.aws_iam_role_policy_attachments_exclusive.discover will be created
+ resource "aws_iam_role_policy_attachments_exclusive" "discover" {
      + policy_arns = [
          + "arn:aws:iam::aws:policy/ReadOnlyAccess",
        ]
      + role_name   = "atlantis-ci-discover"
    }

  # module.access.aws_iam_role_policy_attachments_exclusive.execution will be created
+ resource "aws_iam_role_policy_attachments_exclusive" "execution" {
      + policy_arns = [
          + "arn:aws:iam::aws:policy/ReadOnlyAccess",
        ]
      + role_name   = "atlantis-ci-execution"
    }

  # module.org-read.aws_iam_role.org_read will be created
+ resource "aws_iam_role" "org_read" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Condition = {
                          + StringEquals = {
                              + "sts:ExternalId" = "b5748e1f-0fa5-47c2-b9e2-84108424dd6a"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = [
                              + "arn:aws:iam::179874453562:role/qa-stacklet-platform",
                              + "arn:aws:iam::179874453562:role/qa-collector",
                            ]
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "Access to read accounts information for atlantis-ci Stacklet deployment"
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "atlantis-ci-org-read"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.org-read.aws_iam_role_policy.tags_read will be created
+ resource "aws_iam_role_policy" "tags_read" {
      + id          = (known after apply)
      + name        = "AllowBulkTagRead"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "tag:GetResources"
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # module.org-read.aws_iam_role_policy_attachments_exclusive.org_read will be created
+ resource "aws_iam_role_policy_attachments_exclusive" "org_read" {
      + policy_arns = [
          + "arn:aws:iam::aws:policy/AWSOrganizationsReadOnlyAccess",
        ]
      + role_name   = "atlantis-ci-org-read"
    }

Plan: 18 to add, 0 to change, 0 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p dev
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://python.atlantis.stacklet.dev/lock?id=stacklet%252Fterraform-aws-onboarding%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p dev
  ```
Plan: 18 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```